{
    "name": "Campaign",
    "label": "Campaign Builder",
    "instructions": "Use this form to expand an idea into a playable RPG campaign.",
    "fields": [
        {
            "name": "title",
            "label": "Title",
            "instructions": "",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "world",
            "label": "World",
            "instructions": "Write a bit about the world, the situation, and the part of it all that you personally love and really, really want to GM.",
            "longtext": true,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "changes",
            "label": "Changes",
            "instructions": "What changes are happening in the world? They can be large or small. And they can be the focus of the campaign, or just part of the background.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "goals",
            "label": "Goals and Problems",
            "instructions": "List some goals and problems of people and groups in the world. Some of them should be caused by the changes.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "scope",
            "label": "Scope",
            "instructions": "Where it all happens. Could be a city, a planet, a war, a subculture, etc. Try making it larger, or smaller, than usual.",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "pcs",
            "label": "Who are the PCs?",
            "instructions": "Which people with goals and problems can the players play?",
            "longtext": true,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "mood",
            "label": "Mood",
            "instructions": "Grim, exciting, zany, lyrical, tactical, dream-like, happy, sad, desperate, exuberant, etc. How will the players feel?",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "visual_style",
            "label": "Visual Style",
            "instructions": "How does it look in your mind? Does it look like a favorite movie, comic, artist, etc.?",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        }, 
        {
            "name": "beginning",
            "label": "Beginning",
            "instructions": "How does it begin?",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "end",
            "label": "End",
            "instructions": "How can it end?",
            "longtext": false,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "driver",
            "label": "Drivers",
            "instructions": "These are patterns that can lead to lots of adventures. Pick a few and describe how they can work for your campaign.",
            "longtext": false,
            "isarrayfield": true,
            "hints": [
                {"label": "Agents", "description": "PCs work for someone who sends them on adventures. James Bond works for MI6. Rebels work for the Rebel Alliance. Brave knights work for their king. Indian Jones works for the archeology department at Marshall College. PCs can be an elite team. Or they might work in an obscure corner of some vast bureaucracy.  Examples: The X-Files, Men in Black, Stargate, Sanctuary, Outland, Judge Dee, Agents of Shield, Battlestar Galactica, all the Star Treks, The Avengers, Blade Runner, Mission Impossible, and Torchwood. "},
                {"label": "Freelancers", "description": "Paid freelancers include private detectives, bodyguards, bounty hunters, assassins, hackers, mercenaries, ghost hunters, monster killers, etc. PCs can be guns for hire, swords for hire, spells for hire, or cyberdecks for hire. They could offer wilderness skills or psychic powers. or have a fast ship / zeplin / hovercraft / etc. for hire. The PCs are contacted by their customers and paid to go on adventures. "},
                {"label": "Privateers", "description": "The PCs are raiders-for-profit who are not criminals in the eyes of their own people. Examples include historical privateers, corsairs, Robin Hood, viking raders, border raiders, and people who kill orcs and dragons and take their treasure. Adventures start when the PCs identify a new target."},
                {"label": "Quest", "description": "A journey to achieve a goal. The advantage is a single crystal clear goal. Quests may seek a magical treasure, a cure, or a personal fortune. The Lord of the Rings trilogy is a quest to destroy the ring. Battlestar Galactica is a quest for the legendary lost colony and a new home. Adventures start with the next step along the path to their goal."},
                {"label": "Survival", "description": "PCs may be lost or marooned away from their own kind, trying to stay alive and find a way home. Castaways can be transported by fantastic means and can find themselves in very strange places. Examples: John Carter of Mars Lost in Space, and Farscape. A large group of castaways might turn into a colony. And exiles are deliberate castaways. Or PCs might man a lonely outpost in a dangerous land, or simply try to stay a live in a deadly, futuristic urban wasteland. PCs might be hated, hunted, or tracked by a relentless foe. Survival might also depend on meeting a special need, such as a vampire's need for blood. Survivors explore their environment, fight off attackers, and seek vital resources. They meet new friends and allies, and new enemies. Adventures can start with a new threat to survive or a vital resource to obtain."},
                {"label": "Personal Mission", "description": "The PCs are doing something because they just really want to. They are driven to become the worlds greatest swordsman, to advance science, prove the Hollow Earth is real, avenge some great wrong, or bring back Atlantis. A PC's personal mission might also be an extended hunt or mystery. Or maybe they want to escape from their backwater planet and see the stars, or just get rich and retire. A PC with a personal quest and a personal fortune can employ like-minded PCs as Agents. Adventures start with an opportunity to advance toward the goal."},
                {"label": "Merchants", "description": "Buy low, sell high, and get out alive. Profit is a clear and highly adaptable motivator. Think of the early spice traders in Earth’s Age of Exploration, the caravans along the Silk Road, or prospectors, smugglers, or just traveling peddlers in a dangerous world. Adventures start with an opportunity, or a threat."},
                {"label": "Keys Quest", "description": "A classic… The Great Magic Thing was divided into parts. The parts were scattered and hidden in dangerous places. And the PCs have a reason to find them. Like all quests, it has a final end. But it has a bunch of intermediate ends, too. This pattern is over-used. But it’s over-used because it works. Also, the parts do not have to be magic. They might just be enumerated requirements to achieve some goal. And the players might never even realize that you are using this form. Adventures start with a clue to the next key."},
                {"label": "Wandering Heroes", "description": "PCs have explicitly signed up to fight evil and help those in need. Examples: Knights of the Round Table, Dr. Who, The A-Team. This is a popular classic. But make sure the players explicitly agree to it, because it requires the PCs to do dangerous things without any other rational motivation. Adventures start when heros are needed."},
                {"label": "Treasure Hunters", "description": "Treasure hunting is popular in fiction and is a straightforward source of adventures. Chasing the Big Score works for a short campaign. And PCs who hunt for knowledge or artifacts something else beyond simple wealth might never have to retire. Adventures start with a clue to the next treasure."},
                {"label": "Defenders", "description": "The PCs are motivated to defend something, or defend against something. They might defend a kindom against all threats. Or they might defend their society against vampires or some other magical threat. As long as the threats attack, you have adventures."}
            ]            
        },
        {
            "name": "toy",
            "label": "Toys and Treasures",
            "instructions": "Things the players will love getting and using. Tools, weapons, ammo, defenses, healing, tools, authority, reputation, training, spells, powers, secrets, vehicles, mounts, familiars, etc.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "place",
            "label": "Places",
            "instructions": "Describe some amazing places where action happens.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "side",
            "label": "Sides",
            "instructions": "Groups or important individuals such as dragons, gods, governments, corporations, departments, factions, families, guilds, races, species, supernatural beings, etc. These can be outright foes, or anyone with interests different enough that you might have to negotiate with them.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []           
        },
        {
            "name": "person",
            "label": "People",
            "instructions": "List some NPCs which you would enjoy playing. They can be friends, family, enemies, allies, protectors, protected, buyers, sellers, bosses, minions, copetitors, teachers, students, etc.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "example_pcs",
            "label": "Some example PCs...",
            "instructions": "Write a few lines about some PCs you might enjoy playing.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "adventure",
            "label": "Adventures",
            "instructions": "Can you run some of these classic adventure types? Summarize a few examples.",
            "longtext": false,
            "isarrayfield": true,
            "hints": [
                {"label": "Assault", "description": "Attack a place to achieve a goal. Often there is a planning an preparation phase, followed by sneaking and/or combat, sometimes followed by running away."},
                {"label": "Siege", "description": "Defend a place, and maybe some NPCs, a valuable location, etc. Common phases are discovering the threat,  finding and reaching the refuge, preparing defenses, and multiple waves of attacks with recovery and repair in between. PCs might be rescued by sunrise or the cavalry. Or they might weaken their foes enough to make a run for it, or even just win outright."},
                {"label": "Recon", "description": "Go somewhere dangerous. Gather information to help plan future action. Get out alive."},
                {"label": "Rescue", "description": "Get a person or people (or creatures) safely away from people (or creatures) who are holding them prisoner. The people you rescue might be weak or strong, helpful or difficult."},
                {"label": "Theft", "description": "Get a thing from the other side, without necessarily having to fight them."},
                {"label": "Escape", "description": "PCs have been captured. Most of their equipment has been taken away. And now they try to get away. Escapes can be a nice change of pace where the PCs concentrate on getting out of a place instead of getting in. Other adventures can turn into escapes if the PCs are captured. And a successful escape can double as a recon or an all-out assault from within."},
                {"label": "Gauntlet", "description": "The PCs have to get from point A to point B, possibly while transporting something or someone. And lots of nasties will try to stop them. A gauntlet adventure usually has a linear form, and a clear goal. The pace is fast because the PCs will lose if the enemy has time to organize and concentrate its forces. The theme is overwhelming odds... just not faced all at once. :-)"},
                {"label": "Hunt", "description": "The PCs track/stalk/chase something that (initially) hides and runs away. The hunt can be literal or metaphorical. And the tables might be turned. But the PCs are generally the pursuers. The PCs can themselves be hunted. But this is harder to run and works best when combined with other adventure types."},
                {"label": "Monster Mystery", "description": "Bad things are happening. Investigate. Find the monster. Deal with it."},
                {"label": "Mystery", "description": "As in mystery fiction. Sherlock Holmes, etc. PCs are detectives who investigate and solve the mystery."},
                {"label": "Explore", "description": "Visit all the parts of a dangerous place to find out what's there. Classic dungeon crawling is Treasure Hunters and Privateers Exploring an underground setting."},
                {"label": "Capture", "description": "A Hunt in which someone or something must be taken alive. This is often more complicated than just killing them."},
                {"label": "Trick", "description": "And elaborate deception or con game. The PCs must design, prepare, and execute all the parts of a plan. Each step is played out under that constant threat of being discovered. And the PCs might have to improvise if something unexpected happens."},
                {"label": "Negotiate", "description": "The PCs must identify, locate, contact, and talk to multiple parties to achieve their goal. Combat isn&apos;t the point. But threats are a common tactic. And negotiations might break down."},
                {"label": "Compete", "description": "You can add a competitor to other kinds of adventures. Or build the adventure around competition for some otherwise straightforward goal."}
            ]            
        },
        {
            "name": "character_class",
            "label": "Character Classes",
            "instructions": "If someone published a class-based rules system designed just for this campaign, what would the classes be? The rules you actully use don't have to be class-based. But this is an awesome excercise. I recommend writing up a full page describing each class, like you'd see in a published game.",
            "longtext": false,
            "isarrayfield": true,
            "hints": []            
        },
        {
            "name": "pc_creation_notes",
            "label": "PC Creation Notes",
            "instructions": "Tell the players who they are, and who they can be. You will eventually want to write up something longer. But start with a few notes here.",
            "longtext": true,
            "isarrayfield": false,
            "hints": []            
        },
        {
            "name": "first_adventure",
            "label": "First Adventures",
            "instructions": "Sketch some adventures to draw the player into the world.",
            "longtext": true,
            "isarrayfield": true,
            "hints": []            
        }     
    ]
}
    
